
# Multilayer Switch SVI Inter-VLAN Configuration

## Network Topology Overview

This topology illustrates the configuration of VLANs using a **Multilayer Switch** to facilitate inter-VLAN routing. The diagram consists of three VLANs (HR, Finance, and IT), each configured across different floors, with trunking between switches. A **Switch Virtual Interface (SVI)** is used on the multilayer switch to enable inter-VLAN routing.


---

## VLAN Configuration

In this topology, three VLANs are defined:

- **VLAN 10**: HR Team
- **VLAN 20**: Finance Team
- **VLAN 30**: IT Team

### VLAN Creation on Switch:

```bash
Switch(config)# vlan 10
Switch(config-vlan)# name HR
Switch(config-vlan)# exit

Switch(config)# vlan 20
Switch(config-vlan)# name FINANCE
Switch(config-vlan)# exit

Switch(config)# vlan 30
Switch(config-vlan)# name IT
Switch(config-vlan)# exit
```

---

## Switchport Mode Configuration

Each access port is configured for one of the three VLANs (VLAN 10, VLAN 20, or VLAN 30). Below are the configurations for access ports that belong to each VLAN.

### HR Team (VLAN 10):

```bash
Switch(config)# interface range fa0/2-4
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# exit
```

### Finance Team (VLAN 20):

```bash
Switch(config)# interface range fa0/5-8
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# exit
```

### IT Team (VLAN 30):

```bash
Switch(config)# interface range fa0/9-11
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 30
Switch(config-if-range)# exit
```

---

## Trunk Port Configuration

To allow VLAN traffic between the switches, configure the trunk ports. A trunk port is configured to carry traffic for multiple VLANs.

```bash
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)# switchport mode trunk
Switch(config-if)# exit
```

To allow specific VLANs on the trunk port, we can limit which VLANs are allowed:

```bash
Switch(config-if)# switchport trunk allowed vlan 10,20,30
```

---

## Inter-VLAN Routing with SVI (Switch Virtual Interface)

The multilayer switch uses **SVI** (Switch Virtual Interface) to perform inter-VLAN routing. An SVI must be configured for each VLAN to enable communication between different VLANs.

### SVI Configuration:

For each VLAN, create a virtual interface and assign an IP address that will serve as the default gateway for devices in that VLAN.

#### VLAN 10 (HR Team SVI):

```bash
Switch(config)# interface vlan 10
Switch(config-if)# ip address 192.10.1.10 255.255.255.0
Switch(config-if)# exit
```

#### VLAN 20 (Finance Team SVI):

```bash
Switch(config)# interface vlan 20
Switch(config-if)# ip address 192.10.2.10 255.255.255.0
Switch(config-if)# exit
```

#### VLAN 30 (IT Team SVI):

```bash
Switch(config)# interface vlan 30
Switch(config-if)# ip address 192.10.3.10 255.255.255.0
Switch(config-if)# exit
```

---

## Summary of Topology

- **Multilayer Switch**: Enables inter-VLAN routing via SVIs.
- **SVI Configuration**: Used to route traffic between VLANs.
- **Trunk Port**: Facilitates VLAN traffic flow between switches by encapsulating VLAN tags.
- **Access Ports**: Configured per VLAN for end devices (HR, Finance, IT).

### Devices and VLAN Assignments:

- **HR Team (VLAN 10)**: Devices connected to ports in VLAN 10 will communicate via the SVI IP `192.10.1.10`.
- **Finance Team (VLAN 20)**: Devices connected to ports in VLAN 20 will communicate via the SVI IP `192.10.2.10`.
- **IT Team (VLAN 30)**: Devices connected to ports in VLAN 30 will communicate via the SVI IP `192.10.3.10`.

---

## Additional Information

### Switch Virtual Interface (SVI):

An **SVI** is a virtual interface configured on a multilayer switch that provides Layer 3 functionality (routing). By configuring SVIs for each VLAN, the switch can perform inter-VLAN routing without the need for an external router.

### Trunking:

- **Trunk Ports** carry traffic from multiple VLANs between switches.
- **Dot1q Encapsulation** is used to tag VLAN traffic as it moves across trunk links.
- By default, all VLANs are allowed on a trunk port, but VLAN traffic can be restricted using the `switchport trunk allowed vlan` command.

### Inter-VLAN Routing:

- With SVIs, the multilayer switch can route traffic between VLANs (HR, Finance, IT).
- This allows for communication across different departments without needing external routers.

---

### Best Practices:

- Ensure that **SVI IP addresses** are set as the default gateways for devices in their respective VLANs.
- Limit VLANs on the trunk ports using the `switchport trunk allowed vlan` command to enhance security.
- Use **SVIs** on multilayer switches to perform inter-VLAN routing efficiently.

---
## Lincence and bug reporting
Enjoy and report bugs to https://github.com/mubarak0101/CCNA_Practical_Labs/issues

This is a free project to be used as you like at your own risk as long as you abide by CC0-1.0. https://choosealicense.com/licenses/cc0-1.0/

