
# Standard Access Control List (ACL) Network Topology


## Network Overview

- **Network Type**: Standard ACL for network access control.
- **Device Types**: PCs, Switches, Routers (Cisco 1841), and Servers.
- **Purpose**: Only authorized devices (Server Admins) are allowed access to specific servers, while others are denied access.

## Topology Structure

- **Client PCs**:
  - PC0 (IP: 192.10.1.1) – Allowed to access servers.
  - PC1 (IP: 192.10.1.2) – Access denied.
  - PC2 (IP: 192.10.1.3) – Access denied.
  - PC3 (IP: 192.10.1.4) – Access denied.
  - PC4 (IP: 192.10.1.5) – Allowed to access servers.

- **Servers**:
  - Server0 (IP: 192.10.2.1)
  - Server1 (IP: 192.10.2.2)

- **Router**:
  - Cisco 1841 Router (Router0) managing traffic with ACL rules.

## IP Addressing

- **Client Network (LAN)**: `192.10.1.0/24`
- **Server Network (LAN)**: `192.10.2.0/24`

## ACL Configuration

1. **Deny Rule**: 
   - Denies access to all IP addresses by default to restrict unauthorized devices.
   - Example Command:
     ```plaintext
     Router(config-std-nacl)#20 deny any
     ```

2. **Permit Rule**:
   - Allows specific hosts (IP: 192.10.1.1 and IP: 192.10.1.5) to access the servers.
   - Example Commands:
     ```plaintext
     Router(config-std-nacl)#10 permit host 192.10.1.1
     Router(config-std-nacl)#15 permit host 192.10.1.5
     ```

3. **Applying the ACL**:
   - The ACL named `test` is applied on the appropriate router interface.
   - Example Commands:
     ```plaintext
     Router(config)#ip access-list standard test
     Router(config-std-nacl)#permit host 192.10.1.1
     Router(config-std-nacl)#permit host 192.10.1.5
     Router(config-std-nacl)#deny any
     ```

4. **Verification**:
   - Use `show access-list` to confirm ACL entries:
     ```plaintext
     Router#show access-list
     Standard IP access list test
       10 permit host 192.10.1.1
       15 permit host 192.10.1.5
       20 deny any
     ```

## Access Control Summary

- **Authorized Devices**:
  - **PC0 (192.10.1.1)** and **PC4 (192.10.1.5)** have access to both servers (Server0 and Server1).
- **Unauthorized Devices**:
  - **PC1 (192.10.1.2)**, **PC2 (192.10.1.3)**, and **PC3 (192.10.1.4)** are denied access to servers.

## How to Use This Project

1. Load the topology in Cisco Packet Tracer or your preferred network simulation tool.
2. Apply the ACL configuration as specified above on Router0.
3. Verify the configuration by attempting to access the servers from each PC.

## Additional Notes

- This project uses a Standard ACL, which controls access based on source IP only.
- The ACL is simple but effective for basic network access control, particularly useful in environments with well-defined, limited access needs.

## Lincence and bug reporting
Enjoy and report bugs to https://github.com/mubarak0101/CCNA_Practical_Labs/issues

This is a free project to be used as you like at your own risk as long as you abide by CC0-1.0. https://choosealicense.com/licenses/cc0-1.0/

