
# Extended Access Control List (ACL) Network Topology

This project demonstrates the configuration of an Extended Access Control List (ACL) on a network, providing more granular control by filtering traffic based on source/destination IP addresses and protocols. This README file details the network topology, IP addressing, access permissions, and router configuration.

## Network Overview

- **Network Type**: Extended ACL for enhanced network access control.
- **Device Types**: PCs, Switches, Routers (Cisco 1841), and Servers.
- **Purpose**: Restricts access to servers based on both IP addresses and specific protocols (e.g., HTTP, FTP), allowing more detailed filtering rules.

## Topology Structure

- **Client PCs**:
  - PC0 (IP: 192.10.1.1) – Specific access rules to servers based on protocol.
  - PC1 (IP: 192.10.1.2) – Access denied.
  - PC2 (IP: 192.10.1.3) – Specific protocol access.
  - PC3 (IP: 192.10.1.4) – Access denied.
  - PC4 (IP: 192.10.1.5) – Specific protocol access.

- **Servers**:
  - Server0 (IP: 192.10.2.1) – Services accessible based on ACL configuration.
  - Server1 (IP: 192.10.2.2) – Services accessible based on ACL configuration.

- **Router**:
  - Cisco 1841 Router (Router0) managing traffic with Extended ACL rules.

## IP Addressing

- **Client Network (LAN)**: `192.10.1.0/24`
- **Server Network (LAN)**: `192.10.2.0/24`

## Extended ACL Configuration

1. **Deny Rules**: 
   - Blocks unauthorized IPs from accessing any services on the server network.
   - Example Command:
     ```plaintext
     Router(config-ext-nacl)#deny ip 192.10.1.2 0.0.0.255 any
     ```

2. **Permit Rules**:
   - Allows specific traffic from authorized IP addresses to specified ports (e.g., HTTP on port 80, FTP on port 21).
   - Example Commands:
     ```plaintext
     Router(config-ext-nacl)#permit tcp host 192.10.1.1 host 192.10.2.1 eq 80
     Router(config-ext-nacl)#permit tcp host 192.10.1.5 host 192.10.2.2 eq 21
     ```

3. **Applying the ACL**:
   - The ACL named `extended_test` is applied on the appropriate router interface to manage inbound traffic.
   - Example Commands:
     ```plaintext
     Router(config)#ip access-list extended extended_test
     Router(config-ext-nacl)#permit tcp host 192.10.1.1 host 192.10.2.1 eq 80
     Router(config-ext-nacl)#permit tcp host 192.10.1.5 host 192.10.2.2 eq 21
     Router(config-ext-nacl)#deny ip any any
     ```

4. **Verification**:
   - Use `show access-list` to confirm the extended ACL entries:
     ```plaintext
     Router#show access-list
     Extended IP access list extended_test
       permit tcp host 192.10.1.1 host 192.10.2.1 eq 80
       permit tcp host 192.10.1.5 host 192.10.2.2 eq 21
       deny ip any any
     ```

## Access Control Summary

- **Authorized Devices**:
  - **PC0 (192.10.1.1)** – Allowed to access Server0 over HTTP.
  - **PC4 (192.10.1.5)** – Allowed to access Server1 over FTP.
- **Unauthorized Devices**:
  - **PC1 (192.10.1.2)**, **PC2 (192.10.1.3)**, **PC3 (192.10.1.4)** – Denied access or allowed only to specific services.

## How to Use This Project

1. Load the topology in Cisco Packet Tracer or your preferred network simulation tool.
2. Apply the Extended ACL configuration as specified above on Router0.
3. Verify the configuration by attempting to access the servers from each PC using various protocols.

## Additional Notes

- This project uses an Extended ACL, which provides granular access control by filtering traffic based on IP, port, and protocol.
- Extended ACLs are ideal for environments where specific services or applications need controlled access.

## Lincence and bug reporting
Enjoy and report bugs to https://github.com/mubarak0101/CCNA_Practical_Labs/issues

This is a free project to be used as you like at your own risk as long as you abide by CC0-1.0. https://choosealicense.com/licenses/cc0-1.0/

